src/config/Documents/УстановкаРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаРезерва</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.УстановкаРезерва</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Резерв</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Резервирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаРезерва</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.УстановкаРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидУстановкиРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/Резерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Резерв</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/ВидУстановкиРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидУстановкиРезерва</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снятие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/УстановкаРезерва/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если (Ответственный = Справочники.Пользователи.ПустаяСсылка()) Тогда 
		Ответственный = глТекущийПользователь;
	КонецЕсли;
	
	Если (Отдел = Справочники.Подразделения.ПустаяСсылка()) Тогда 
		Отдел = ПолучитьЗначениеПоУмолчанию(глТекущийПользователь,"ОсновноеПодразделение");	
	КонецЕсли;
	
	ВыполнитьДвиженияПоРезерву(Отказ);
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРезерву(Отказ)
	
	ДвиженияРезерв = Движения.Резерв;
	
	Для Каждого Стр из Резервирование Цикл
		
		Если (Стр.ВидДвижения=Перечисления.ВидУстановкиРезерва.Установка) Тогда 
			ДвижениеРезерв 					= ДвиженияРезерв.Добавить();
			ДвижениеРезерв.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			ДвижениеРезерв.Номенклатура 	= Стр.Номенклатура;
			ДвижениеРезерв.Количество		= Стр.Количество;
			ДвижениеРезерв.Период			= Дата;			
			ДвижениеРезерв.ДокументРезерва 	= Ссылка;
		ИначеЕсли (Стр.ДокументРезерва=Неопределено) Тогда 
			// Списываем по фИФО
			Запрос = новый Запрос;
			Запрос.УстановитьПараметр("Документ",Ссылка);
			Запрос.УстановитьПараметр("Номенклатура",Стр.Номенклатура);
			Запрос.УстановитьПараметр("Дата",Дата);
			Запрос.УстановитьПараметр("ДатаРез",НачалоДня(Дата));
			Запрос.УстановитьПараметр("Подразделение",Отдел);
			Запрос.Текст = "
				|	Выбрать
				|	Номенклатура,
				|	ДокументРезерва,
				|	КоличествоОстаток
				|Из РегистрНакопления.Резерв.Остатки(&Дата,Номенклатура = &Номенклатура)
				|Где 
				|	ДобавитьКДате(ДокументРезерва.Дата,ДЕНЬ,ДокументРезерва.ДлинаРезерва)>=&ДатаРез И ДокументРезерва<>&Документ "
				+ ?(Отдел<>Справочники.Подразделения.ПустаяСсылка(),"И ДокументРезерва.Отдел=&подразделение","") + "
				|Упорядочить по ДокументРезерва.Дата";
			ВыбТабл = Запрос.Выполнить().Выгрузить();
			СуммаКоличества = ВыбТабл.Итог("КоличествоОстаток");
			Если (СуммаКоличества<Стр.Количество) Тогда 
				Сообщить("Необходимо еще " + Строка(Стр.Количество - СуммаКоличества) + " единиц  номенклатуры " + Стр.Номенклатура + " в резерве." ,СтатусСообщения.Важное);
				Отказ = Истина;
			Иначе 
				КоличествоДляСписания = Стр.Количество;
				Для Каждого СтрТ из ВыбТабл Цикл
					ДвижениеРезерв 					= ДвиженияРезерв.Добавить();
					ДвижениеРезерв.ВидДвижения 		= ВидДвиженияНакопления.Расход;
					ДвижениеРезерв.Номенклатура 	= Стр.Номенклатура;
					ДвижениеРезерв.Количество		= Мин(СтрТ.КоличествоОстаток,КоличествоДляСписания);
					ДвижениеРезерв.Период			= Дата;			
					ДвижениеРезерв.ДокументРезерва 	= СтрТ.ДокументРезерва;	
					КоличествоДляСписания 			= КоличествоДляСписания - СтрТ.КоличествоОстаток;
					Если (КоличествоДляСписания<=0) Тогда 
						Прервать;
					Конецесли;
				КонецЦикла;
			КонецЕсли;			
		Иначе 
			// Устанавливаем документ явно
			// С проверкой остатков
			КоличествоПоДокументу = КоличествоВРезервеПоДокументу(Стр.Номенклатура,Стр.ДокументРезерва);
			Если (КоличествоПоДокументу>=Стр.Количество) Тогда 
				ДвижениеРезерв 					= ДвиженияРезерв.Добавить();
				ДвижениеРезерв.ВидДвижения 		= ВидДвиженияНакопления.Расход;
				ДвижениеРезерв.Номенклатура 	= Стр.Номенклатура;
				ДвижениеРезерв.Количество		= Стр.Количество;
				ДвижениеРезерв.Период			= Дата;			
				ДвижениеРезерв.ДокументРезерва 	= Стр.ДокументРезерва;			
			Иначе 
				Сообщить("По документу " + Стр.ДокументРезерва + " всего " + КоличествоПоДокументу + " " + Стр.Номенклатура + " требуется еще" + Строка(Стр.Количество - КоличествоПоДокументу) + " единиц.",СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ДвиженияРезерв.Записать();
	
КонецПроцедуры

Функция КоличествоВРезервеПоДокументу(Номенклатура,ДокументРезерва)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ",ДокументРезерва);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаРез",НачалоДня(ТекущаяДата()));
	Запрос.ТЕкст = "
	|	Выбрать 
	|	Номенклатура,
	|  	Сумма(КоличествоОстаток) как КоличествоОстаток
	|  		ИЗ
	|	(
	|	Выбрать
	|	Номенклатура,
	|	ДокументРезерва,
	|	КоличествоОстаток
	|Из РегистрНакопления.Резерв.Остатки(&Дата,Номенклатура = &Номенклатура)
	|Где 
	|	ДобавитьКДате(ДокументРезерва.Дата,ДЕНЬ,ДокументРезерва.ДлинаРезерва)>=&ДатаРез И ДокументРезерва=&Документ)
	| как ПЗ
	|Сгруппировать по 
	|Номенклатура";
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Если (Выб.Следующий()) Тогда 
		Возврат Выб.КоличествоОстаток;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
Конецфункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры
